Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # cloudflare_filter.transmission will be updated in-place
~ resource "cloudflare_filter" "transmission" {
        description = "Limit access to Portainer and Transmission to Docker network, server itself, home and office IPs"
      ~ expression  = <<~EOT
            (
              http.host in {"portainer.milanvit.net" "transmission.milanvit.net"}
              and not (
          -     ip.src in {172.17.0.0/16 111.98.60.102 148.251.233.134 183.77.1.74 122.218.87.26 122.218.87.66}
          +     ip.src in {172.17.0.0/16 111.98.60.102 148.251.233.134 183.76.253.191 122.218.87.26 122.218.87.66}
                or http.request.uri.path contains "/.well-known/acme-challenge/"
              )
            )
        EOT
        id          = "6e4e0860de6a4fa2a7bcccb6e8269747"
        paused      = false
        zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["mail-sendgrid"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "em3989"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "u17542702.wl203.sendgrid.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["mail-sendgrid-domainkey-1"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "s1._domainkey"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "s1.domainkey.u17542702.wl203.sendgrid.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["mail-sendgrid-domainkey-2"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "s2._domainkey"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "s2.domainkey.u17542702.wl203.sendgrid.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.milanvit.net/lock?id=Cellane%252Fmilanvit.net%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
